<script>
export default {
  name: 'IndexPage'
}
</script>

<template lang="pug">
.container
  .hero
    h1 Задание
    h3 Описание
    p Пользователь вводит в поле свой логин инстаграм или ссылку на профиль.
    p После нажатия "Сохранить", на странице появляется ссылка на страницу пользователя в инстаграм, вне зависимости от того, ввел пользователь свой логин или указал ссылку.

    h3 Проверки
    ol
      li Если пользователь ввел логин, нужно проверить, что это валидный логин инстаграм.
        ol
          li Если логин валидный - переходим к пункту 3.
          li Если логин не валидный - переходим к пункту 4.
      li Если пользователь ввел ссылку, нужно проверить, что это валидная ссылка на инстаграм (https://instagram.com).
        ol
          li Если ссылка валидная - переходим к пункту 3.
          li Если ссылка не валидная - переходим к пункту 4.

      li Нажатие "Сохранить"
        ol
          li Форматируем пользовательские данные так, чтобы получилась ссылка вида https://instagram.com/username. Вместо username - логин пользователя.

      li При ошибке выводим пользователю
        ol
          li Если пользователь ввел ссылку на другой ресурса, не инстаграм (например www.ilko.me), пишем - неправильная ссылка.
          li Если пользователь ввел неправильный логин пишем - неправильный логин.
          li Если пользователь ввел валидную ссылку инстаграм (https://instagram.com), но забыл или неправильно указал логин пишем - неправильный логин. Например https://instagram.com/!ilkome - должна быть ошибка, т.к. логин с "!" не валидный.
  Form
</template>

<style lang="stylus" scoped>
// styles here
</style>
